{"content": "# CSS Authoring\n\n## Compass\n\nThis project uses [compass](http://compass-style.org) to create \nthe [CSS](http://en.wikipedia.org/wiki/Cascading_Style_Sheets) resources \nthat will be used by the web application.  I have chosen to \nuse [Sassy CSS](http://sass-lang.com)\n[docs](http://sass-lang.com/documentation/file.SASS_REFERENCE.html) \nas the syntax to author the css resources.  Being an extension of the \nsyntax of CSS3, any valid css file can be used directly as a scss file,\ndeveloper to fully use the compass framework on css files that have \nalready been designed for other sites.\n\n### Plugins\n\nThis project uses the [bootstrap-sass](https://github.com/twbs/bootstrap-sass) \nplugin for compass, making it easier to customize pages that use the \n[bootstrap](http://getbootstrap.com/) framework.  Also, a helper for \ngenerating [jquery-ui](FIXME) themes,\n[Compass UI](https://github.com/patrickward/compass-ui), is used in \nthis probject.  This project provides an example of how both the \nbootstrap and jquery-ui plugins can be configured to use the same \ncolor themes, and there is a python script that generates the\nscss files.  The example is imcomplete, but provides enough to \ndirect the css developer on how to proceed.  A plugin for creating \nbuttons, [Sassy Buttons](http://jaredhardy.com/sassy-buttons/), is also \nbeing used.\n\n### Icons\nFinally, [FontAwesome](http://fontawesome.io/), is \nbeing used to provide icons.  The scss files are \ncopied from the\n[git repository](https://github.com/FortAwesome/Font-Awesome/tree/master/scss),\nand may need to be updated.  In the future, I'd like to use\n[font-awesome-sass](https://github.com/FortAwesome/font-awesome-sass) to\ndo this.  In the past, I had trouble integrating this into compass,\nbut it's possible that this problem has disappeared.  If it hasn't\ndisappeared, [bower](http://bower.io) can still be used to track the\nupstream source and use a script to install the scss files into the\nsass/partials directory.\n\n### FullCalendar\n\nThe css file for [FullCalendar](http://arshaw.com/fullcalendar/),\nhas been copied verbatim and renamed to an scss file.  This was \ndone to exemplify how easy it is to directly import css into \nthe project.\n\n## Goals for Authoring Environment\n\nThe primary goal for using compass and scss syntax is to provide \na person who designs webpages the tools to design in a manner they \nare most likely to be comfortable with.  Stylesheets that they have \ndeveloped in other projects can be directly imported, then manipulated \nvery easily.\n\nThe author of this project is a web page designer, but merely a \nweb service/application designer.  The example scss may not be \nthe most pleasing to the eye, and there are many styles variables \nthat have not been modified to match the other colors, and there \nis some work to be done to make the example themes more coherent \nand pleasant.\n", "id": "css-authoring"}