{"content": "# Creating a Static Website with GitHub\n\n## GitHub Pages\n\nGitHub Pages provide a static website for your project that is, \nby nature of the service, kept in a git repository.  This makes \nupdating the site, and even reverting parts of it back to an \nearlier version easy.\n\nFor coding projects, I often make my websites by taking specially \nformatted text files, such as restructured text or markdown, and \nrender the files to html, then post the html files to the \ndocument root.  For the GitHub sites, I decided to basically \nwrite the pages in the same manner, except for now I am limited to \nusing markdown.  The difference is that I am not rendering the \nmarkdown text to html, rather the web browser will be doing this.\n\nThe desire is to use [requirejs-text](https://github.com/requirejs/text) \nto retrieve the file content by name, then have the client render \nthe text.  At the moment, this isn't working, so I am using a \nscript to take the markdown files and create a JSON object that is \nstored in a corresponding .json file, which is retrieved in an \n[xhr](http://en.wikipedia.org/wiki/XMLHttpRequest) request.  When \nthis difficulty is overcome, all that will need to be done will be \nmanage *one* directory of text files.\n\n\n## Vagrant\n\nI am using [Vagrant](http://vagrantup.com) to house the development \ntools to build the website.  I use a [nodejs](http://nodejs.org) \nenvironment to develop the website, using [Grunt](http://gruntjs.com) \nto handle much of the work.  I am also using the basebox I created \nto help with web development, \n[trumpet-i386](https://vagrantcloud.com/umeboshi/trumpet-i386).\n\nThe trumpet box comes with fairly recent versions of nodejs,\n[compass](http://compass-style.org), \n[coffee script](http://coffeescript.org), Grunt,\n[Bower](http://bower.io), and some ruby gems to help with \nstylesheet development.\n\n\n## Trumpet without pyramid\n\n[static](#pages/trumpet-resources) resources", "id": "github-pages"}