{"content": "# Javascript Components\n\nThis project uses a collection of javascript resources to help \ndevelop applications.  The collection is rather large when \nthe ace editor is included, and at the time of this writing,\nthe built and minified [conspectus](http://umeboshi2.github.io/conspectus)\napp is 329 Kilobytes.  This collection is provided to assist \nin application development, but not all components are necessary \nfor every application that is intended.\n\n## Basic Components\n\n-  [Requirejs](http://requirejs.org):\n   Required.  This could possibly be replaced with almond.\n   \n-  [jQuery](http://jquery.com/): \n   jQuery is a very good for selecting and maninpulating elements in the DOM.\n\n-  [Bootstrap v3](http://getbootstrap.com/): \n   Bootstrap is a CSS/Javascript framework used to help make responsive \n   websites.  Bootstrap was selected to be used in order to serve to \n   mobile devices.  The CSS is handled through compass with bootstrap-sass.\n   \n-  [Underscore.js](http://underscorejs.org/): \n   Underscore is a library full of useful utilities, and like jqueryui, is \n   depended upon by other javascript libraries I use.\n\n-  [Backbone.js](http://backbonejs.org/): \n   Backbone is an excellent library that provides an api to make very \n   rich views tied to models that are seamlessly synchronized with \n   the server via a REST interface.\n\n-  [Marionette](http://marionettejs.com/):\n   \"Backbone.Marionette is a composite application library for \n   Backbone.js that aims to simplify the construction of large scale \n   JavaScript applications,\" and it is very effective at doing this.\n   This is the primary library used in this project for creating \n   single page applications.\n\n-  [Teacup](http://goodeggs.github.io/teacup/):\n   \"Teacup is templates in CoffeeScript.\"\n   Teacup makes it very easy to create html templates\n   for backbone.  It is a \n   [domain specific language](http://en.wikipedia.org/wiki/Domain-specific_language) \n   for coffeescript that makes it pleasant to use as a \n   microtemplating solution.  Currently, almost all the \n   html rendered by the application is done with teacup.\n\nThe foregoing components comprise the minimal set of libraries \nthat should be considered *required* for application development.  The \nbootstrap component shouldn't be seen as *strictly required*, but \nit is small and useful for a responsive environment.  A similar \nargument could be made for teacup as well, but since the development \nenvironment is a coffeescript environment, teacup fits really well.\n\nWhile it is up to the application developer to decide upon the\nminimal framework required, the stack above is a good collection \nthat provides a lot of ability in a small stack size.\n\n\n\n## Other Components\n\n-  [jQuery User Interface](http://jqueryui.com/): \n   jQueryUI is used for the fullcalendar widget, as well as for dialog boxes \n   and other user interface elements that aren't used through boostrap.  The \n   corresponding styles are maintained with compass.\n\n-  [FullCalendar](http://arshaw.com/fullcalendar/): \n   FullCalendar is a very good library that provides an interactive \n   calendar where events can be retrieved dynamically and grouped, \n   colored, or otherwised styled in many ways.  The calendar provides \n   monthly, weekly, and daily view models to interact with.\n\n-  [Ace Editor](http://ace.c9.io/#nav=about): \n   The ACE editor is a good text editor that is very useful for \n   editing html, css, java/coffee scripts, and other formats that\n   aren't being used yet.\n   \n\n## Bower\n\nThe javascript components are managed with [bower](http://bower.io).\nWhile bower is great at managing and retrieving components and \ntheir dependencies, it also installs many unecessary files in \nthe component space, which may be problematic for some deployments.  \nIn this project, there is a script to transfer only the required \ncomponents from the bower install directory to a specified \ndeployment directory for easier packaging.\n\n", "id": "javascript-components"}