{"content": "## Trumpet Static Resources\n \n### CSS Framework\n\n-  [Compass](http://compass-style.org/):  \n   Compass is the tool I use to generate my CSS resources.  The CSS \n   specification has no definitios for variables, forcing many web \n   developers to make class names such as \"green\" and then add CSS \n   code like this:\n   \n   ```css\n   .green {\n\t   background-color: green;\n   }\n   ```\n\t\t\t   \n   But what the developer really needs is something more along this \n   idea:\n   \n        .warn {\n\t\tbackground-color: $warning-background;\n\t\t}\n\t\t   \n   . . . which helps to simplify the structure of the CSS and remove some \n   of the bad hacks that are used to workaround the deficiencies of \n   the CSS specification.\n\n-  [Susy](http://susy.oddbird.net/)(Unused):\n   Susy is a grid layout system that will allow for responsive webpages.  I \n   am not using this anymore, as bootstrap is currently handling the \n   responsive grid layout, but Susy is superior to bootstrap and since I \n   am also using bootstrap-sass, I feel that I can eventually reimplement \n   the bootstrap grid layout in Susy.  UPDATE: I decided to use the \n   bootstrap grid system for the time being.\n\n-  [Sassy Buttons](http://jaredhardy.com/sassy-buttons/): \n   This is a collection of mixins and defaults that help a developer make\n   custom buttons very easily.\n\n-  [Bootstrap for Sass](https://github.com/thomas-mcdonald/bootstrap-sass): \n   This wonderful package allows me to refrain from using the css that is \n   provided with bootstrap and quickly make a custom version that I can \n   integrate more closely with other objects on the page.  Having bootstrap \n   in this form allows me to adjust how bootstrap operates and allows me \n   to only choose the parts I need (Currently everything is included).\n   \n-  [FontAwesome](http://fontawesome.io/):\n   Instead of just using the basic css, I have chosen to use the \n   fontawesome-sass distribution.  This provides scalable vector icons\n   to websites.\n   \n-  [Compass UI](https://github.com/patrickward/compass-ui): \n   This compass plugin provides the ability to generate jQueryUI themes\n   with a minimum of effort.  I have spent hours on the themeroller before\n   trying to create a custom theme that would match the general colors that \n   I use on a web page.  With this plugin, all I have to do is set the \n   variables to correspond to the color variables that I use elsewhere on the \n   page and I instantly get themed widgets that don't look like they came \n   from another site.\n   \n\n### Basic Javascript Libraries\n\n-  [Requirejs](http://requirejs.org):\n   Required.\n   \n-  [jQuery](http://jquery.com/): \n   jQuery is a very good for selecting and maninpulating elements in the DOM.\n\n-  [jQuery User Interface](http://jqueryui.com/): \n   jQueryUI is used for the fullcalendar widget, as well as for dialog boxes \n   and other user interface elements that aren't used through boostrap.  The \n   corresponding styles are maintained with compass.\n\n-  [Bootstrap v3](http://getbootstrap.com/): \n   Bootstrap is a CSS/Javascript framework used to help make responsive \n   websites.  Bootstrap was selected to be used in order to serve to \n   mobile devices.  The CSS is handled through compass with bootstrap-sass.\n   \n-  [Underscore.js](http://underscorejs.org/): \n   Underscore is a library full of useful utilities, and like jqueryui, is \n   depended upon by other javascript libraries I use.\n\n-  [Backbone.js](http://backbonejs.org/): \n   Backbone is an excellent library that provides an api to make very \n   rich views tied to models that are seamlessly synchronized with \n   the server via a REST interface.\n\n-  [FullCalendar](http://arshaw.com/fullcalendar/): \n   FullCalendar is a very good library that provides an interactive \n   calendar where events can be retrieved dynamically and grouped, \n   colored, or otherwised styled in many ways.  The calendar provides \n   monthly, weekly, and daily view models to interact with.\n\n-  [Ace Editor](http://ace.c9.io/#nav=about): \n   The ACE editor is a good text editor that is very useful for \n   editing html, css, java/coffee scripts, and other formats that\n   aren't being used yet.\n   \n-  [CoffeeScript](http://coffeescript.org/):\n   I am currently experimenting executing coffeescript on the client \n   using the browser to compile the code.  While compilation is \n   generally quick on the browser, the size of the compiler (196KB, and \n   already minified) encourages me to consider implementing server side \n   compilation.\n  \n-  [Teacup](http://goodeggs.github.io/teacup/):\n   \"Teacup is templates in CoffeeScript.\"  -- nuff said\n   http://en.wikipedia.org/wiki/Domain-specific_language\n  \n", "id": "trumpet-resources"}